УчетВУправляющихДляГит1/src/Catalogs/КлассификаторВидовПредпринимательскойДеятельностиЕНВД/КлассификаторВидовПредпринимательскойДеятельностиЕНВД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторВидовПредпринимательскойДеятельностиЕНВД</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияПоМестуНахожденияОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяДоходность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФизическогоПоказателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодсказкаФизическогоПоказателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/КлассификаторВидовПредпринимательскойДеятельностиЕНВД/Forms/ФормаВыгрузкиКлассификатора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.Код КАК Код,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.Наименование,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.НаименованиеПолное,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.РегистрацияПоМестуНахожденияОрганизации,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.БазоваяДоходность,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.ИмяФизическогоПоказателя,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.ПодсказкаФизическогоПоказателя
	|ИЗ
	|	Справочник.КлассификаторВидовПредпринимательскойДеятельностиЕНВД КАК КлассификаторВидовПредпринимательскойДеятельностиЕНВД
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	ТаблицаВидовПредпринимательскойДеятельностиЕНВД = Запрос.Выполнить().Выгрузить();
	
	СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ТаблицаВидовПредпринимательскойДеятельностиЕНВД);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(СтрокаXML);
	
КонецПроцедуры

#КонецОбласти
